{
  "landing": {
    "title": "full-stack web developer",
    "myProjects": {
      "title": "My Projects",
      "gt": "goodteacher mobile app",
      "nh": "NewHome chromium extension",
      "other": "other projects"
    }
  },
  "gt": {
    "title": "Online student notebook replacement",
    "description": {
      "1": "Mobile app",
      "2": "is an online replacement for a student's notebook. It's made for teachers and students, primarily with music schools in mind, but it can be used in any field. Teachers can create classes, add students to them and send out tasks for students. The students can join classes and manage their tasks - complete or add more of them. It is a mobile application written in React Native with a Node.js server and a database."
    },
    "features": {
      "title": "Features:",
      "1": "teacher or student account type",
      "2": "account activation through email",
      "3": "remotely assigning tasks to students as a teacher",
      "4": "offline access to tasks",
      "5": "infrastructure designed with user data security in mind",
      "6": "fun randomly generated student avatars",
      "7": "two languages (PL, ENG)"
    }
  },
  "nh": {
    "title": "Productivity focused Chromium extension",
    "description": "Chromium extension replacing default new tab with a custom productivity focused application.",
    "features": {
      "title": "Features:",
      "1": "habit tracking",
      "2": "task tracking",
      "3": "Spotify API integration -> currently playing track",
      "4": "Google Calendar API integration -> current task",
      "5": "daily stoic phrase from stoic quotes API",
      "6": "website shortcuts",
      "7": "daily browsing time tracking"
    }
  },
  "other": {
    "title": "Other projects",
    "sla": {
      "header": "Spotify Listen Along",
      "description": "Application allowing multiple people to listen along to one spotify playback controlled by one person. Uses WebSocket communication protocol."
    },
    "react-native-boring-avatars": {
      "header": "react-native-boring-avatars",
      "description": "My React Native implementation of Boring Avatars packaged and published on npm. It fixes blurry svg problem from other React Native implementations."
    },
    "flight-route": {
      "header": "Flight route calculator",
      "description": "Application that calculates data needed for a flight plan based on input data and a route drawn on an OpenLayers map. It features an option to read magnetic declination and wind data from external sources via HTTP. It provides authorization built around google sign in and JWT tokens and a possibility of saving previous flights in a PostgreSQL database. Includes e2e tests."
    },
    "scraper": {
      "header": "stock price scraper",
      "description": "CLI application that scrapes the barchart website for stock price data. Implemented with apt cooldown period between requests so as not to overload the website servers."
    },
    "portfolio": {
      "header": "This website",
      "description": "Fully custom-made portfolio website. No templates used."
    }
  },
  "mySkills": "My Skills:",
  "builtWith": "Built with:"
}
